In [131]:
import numpy as np

In [90]:
import pandas as pd
import datetime
from numpy.random import randn
from numpy.random import randint

In [28]:
datetime.datetime.today()

datetime.datetime(2017, 10, 14, 20, 56, 52, 956275)

In [57]:
#ways to construct a dataframe object
df1 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index = [datetime.datetime.today(),datetime.datetime.today(),datetime.datetime.today()],columns=['col1','col2','col3'])
df1

                            col1  col2  col3
2017-10-14 21:12:47.315541     1     2     3
2017-10-14 21:12:47.315552     4     5     6
2017-10-14 21:12:47.315557     7     8     9

In [55]:
df1 = pd.DataFrame(randn(3,3),index = [datetime.datetime.today(),datetime.datetime.today(),datetime.datetime.today()],columns=['col1','col2','col3'])
df1

                                col1      col2      col3
2017-10-14 21:10:53.608052 -0.466544 -1.686160 -0.010880
2017-10-14 21:10:53.608066  0.348392 -0.942903 -0.526323
2017-10-14 21:10:53.608070  0.230792  0.791695 -0.431194

In [56]:
#use the default numeric index
df2 = pd.DataFrame(randn(3,3),columns=['col1','col2','col3'])
df2

       col1      col2      col3
0  0.242807  0.222122 -2.054762
1  1.055717  0.125404  0.475234
2  0.785034  1.171276 -0.932852

In [128]:
#use dictionary to construct a dataframe, where key is index
dic = {datetime.datetime.today():randn(3),datetime.datetime.today():list(randn(3)),datetime.datetime.today():list(randn(3))}
index = ['index1','index2','index3']
df3 = pd.DataFrame(dic,index)
df3

,2017-10-14 21:34:25.373799,2017-10-14 21:34:25.373836,2017-10-14 21:34:25.373865
index1,-1.016507,1.200618,-1.005682
index2,-0.295668,1.289619,0.863681
index3,1.323096,-1.579461,-0.064650

In [139]:
np.array([1,2,4]) # you get an array
list(np.array([1,2,4]))# get a list

#practise ndarray
np.ndarray(shape=(2,2))
np.ndarray(shape=(2,2),buffer=randn(2,2))
np.ndarray(shape=(2,2),dtype=int,buffer=randint(2,size=4))

array([[1, 0],
       [0, 1]])

In [145]:
#practise generating random number
randn(2) #standard normal distribution
randn(2,2)
randint(low=1,high=4,size=10) #uniform distribution
randint(1,4,size=(2,2))

array([[2, 3],
       [1, 2]])

In [3]:
left = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                     'key2': ['K0', 'K0', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [4]:
left

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K1   K0
2  A2  B2   K1   K0
3  A3  B3   K2   K1

In [5]:
right

    C   D key1 key2
0  C0  D0   K0   K0
1  C1  D1   K1   K0
2  C2  D2   K1   K0
3  C3  D3   K2   K0

In [6]:
pd.merge(left, right,on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A1  B1   K1   K0  C1  D1
2  A1  B1   K1   K0  C2  D2
3  A2  B2   K1   K0  C1  D1
4  A2  B2   K1   K0  C2  D2

In [7]:
pd.merge(left,right,how ='left',on=['key1','key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K1   K0   C1   D1
2  A1  B1   K1   K0   C2   D2
3  A2  B2   K1   K0   C1   D1
4  A2  B2   K1   K0   C2   D2
5  A3  B3   K2   K1  NaN  NaN

In [8]:
pd.merge(left,right,how ='outer',on=['key1','key2'])

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K1   K0   C1   D1
2   A1   B1   K1   K0   C2   D2
3   A2   B2   K1   K0   C1   D1
4   A2   B2   K1   K0   C2   D2
5   A3   B3   K2   K1  NaN  NaN
6  NaN  NaN   K2   K0   C3   D3

In [9]:
pd.merge(left,right,how ='right',on=['key1','key2'])

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A1   B1   K1   K0  C1  D1
2   A2   B2   K1   K0  C1  D1
3   A1   B1   K1   K0  C2  D2
4   A2   B2   K1   K0  C2  D2
5  NaN  NaN   K2   K0  C3  D3

In [10]:
left.join(right,lsuffix='_left',rsuffix='_right')

    A   B key1_left key2_left   C   D key1_right key2_right
0  A0  B0        K0        K0  C0  D0         K0         K0
1  A1  B1        K1        K0  C1  D1         K1         K0
2  A2  B2        K1        K0  C2  D2         K1         K0
3  A3  B3        K2        K1  C3  D3         K2         K0

In [11]:
ll=left.set_index(['key1','key2'])

In [12]:
rr=right.set_index(['key1','key2'])

In [13]:
ll.join(rr)

            A   B    C    D
key1 key2
K0   K0    A0  B0   C0   D0
K1   K0    A1  B1   C1   D1
     K0    A1  B1   C2   D2
     K0    A2  B2   C1   D1
     K0    A2  B2   C2   D2
K2   K1    A3  B3  NaN  NaN

In [17]:
left['A'].value_counts()

A2    1
A1    1
A3    1
A0    1
Name: A, dtype: int64